[
  {
    "id": "restaurer-un-videoclip-tourne-en-hi-8",
    "title": "Restaurer un vidéoclip tourné en Hi-8",
    "author": "Mathieu Lalonde",
    "photo": "blogs/freak_like_the_rest/thumb.webp",
    "abstract": "Le passé et le présent se rencontrent lors de la restauration d'un tournage guérilla des années '90.",
    "postDate": "2024-09-24",
    "categories": [
      "montage",
      "davinci resolve",
      "hi-8"
    ],
    "content": "\nJ'ai récemment commencé à explorer les différentes fonctionnalités de DaVinci Resolve pour ce qui est de la coloration et de la conversion de formats, en particulier dans le cas d'archives de définition standard. J'avais, en particulier, envie de donner un look plus «&nbsp;filmique&nbsp;» à certaines de mes anciennes productions.\n\nJ'ai immédiatement pensé à «&nbsp;Freak Like The Rest&nbsp;», un vidéoclip noir et blanc produit pour le groupe Treebeard dans les années ‘90. \n\nMais tout d’abord, un peu de contexte&nbsp;:\n\n\n## Le tournage\n\nLe tournage du clip s'est déroulé à Ottawa en une seule journée de fin de semaine à l'hiver 1997.\n\n<img src = \"/blogs/freak_like_the_rest/treebeard.webp\" alt=\"Les membres du groupe marchent en ville\" className=\"blogphoto\">\n\nMalheureusement, j'avais déjà fait sauter ma fameuse Sony CCD-V5000 professionnelle en tentant de tourner un dessin animé l'été précédent. C'est donc munis d'une petite caméra Hi-8 4:3 consommateur, la RCA PRO846 que nous nous sommes rendus à Green's Creek pour débuter le tournage avant d'ensuite se rendre au centre ville d'Ottawa pour le reste du tournage, terminant le tout dans un stationnement sous-terrain.\n\n<img src = \"/blogs/freak_like_the_rest/gilles.webp\" alt=\"Mathieu et Gilles durant le tournage\" className=\"blogphoto\">\n\n\n## Le montage original\n\nLe montage s'est effectué en S-VHS (via un Panasonic AG-1970) le soir même du tournage dans la salle de montage d'Impact Vidéo, c'est à dire, dans mon sous-sol. \n\n<img src = \"/blogs/freak_like_the_rest/impact_video.webp\" alt=\"Salle de montage Impact Vidéo c.1997\" className=\"blogphoto\">\n\nPuisque les images d'hiver avaient déjà un look très délavé, nous avons opté pour un traitement noir et blanc avec des «&nbsp;bretelles 16:9&nbsp;» et un faux look film superposé au montage. \n\nPuisque tout était fait de façon analogique, nous avons donc obtenu le noir et blanc en ne branchant que partiellement le connecteur S-Vidéo (Y/C) de la caméra de façon à ce que seulement la luminance soit utilisée. Les égratignures de film venaient d'une VHS (<a href=\"https://www.youtube.com/watch?v=76O1snqqWiA&t=790\" target=\"_blank\">The Digital Mixer Companion Vol.2 </a> - Elite Video, 1991) qui était lu par un deuxième lecteur et superposé via un tableau d'aiguillage Panasonic WJ-AVE5.\n\n<img src = \"/blogs/freak_like_the_rest/alain_combo.webp\" alt=\"Avant/Après tournage vs montage 1997\">\n<br/>\n\nPour le montage en tant que tel, tout était fait de façon linéaire et «&nbsp;à la mitaine&nbsp;», machine-à-machine, sans contrôleur automatique. Pour ajouter une plan, on mettait le compteur de la caméra à zéro à la première image, reculait la cassette et on la faisait jouer. Quand le compteur atteignait -1 seconde, on débutait l'enregistrement...\n\nCompte tenu de tout cela, le résultat final est encore surprenant !\n\n\n## La restauration HD\n\nAu début des années 2010, toutes les 34 minutes du tournage Hi-8 ont été lues sur une caméra Digital-8 Sony et copiées sur MiniDV via FireWire pour ensuite être numérisées dans AVID Media Composer. Le master S-VHS suivit un parcours similaire. C'est à partir de ces images numériques que toute la restauration serait maintenant effectuée.\n\nLe but de cette nouvelle restauration était de conserver l'intention de l'originale tout en donnant l'impression d'un film à petit budget tournée sur une pellicule de 8 ou 16mm. Il fallait donc tenter de camoufler tous les aspects les plus «&nbsp;vidéo&nbsp;» de l'image, tels que son contraste exagéré ainsi que certains défauts inhérents à un tournage vidéo de l'époque.\n\nLa musique — cette fois en stéréo — fut importée à partir du CD «&nbsp;Pacemaker&nbsp;» (1997) de Treebeard et insérée dans le montage. Incidemment, mon nom apparaît parmi la liste des remerciements à l'intérieur du livret de cet album...\n\n<img src = \"/blogs/freak_like_the_rest/cd_pacemaker.webp\" alt=\"L'album Pacemaker\" className=\"blogphoto\">\n\n\n### Gonfler le tournage et le convertir en 24 images/sec\n\nPour commencer, tout le matériel fut importé dans DaVinci Resolve et le tournage fut re-comformé au master original dans une séquence HD à 23.976p.\n\nCeci n'était pas facile parce qu'on utilisait une image SD non-anamorphique d'environs 720 x 342 pour remplir un cadre HD de 1920x1080. Il a donc fallu désentrelacer, étirer, clarifier, flouter le tournage. Dans certains cas, il était possible d'utiliser le tournage «&nbsp;open matte&nbsp;» pour recadrer une image de haut en bas, chose qui nous avait été impossible en 1997.\n\nHeureusement, le style visuel adopté originalement nous permettait de compenser pour une résolution inférieure par un surplus de grain, créant l'illusion de nouveaux détails. Le résultat est meilleur sur les closeups que pour les plans larges parce qu'on peut accentuer les détails déjà existants. Ça tombe bien parce qu'il y a beaucoup.\n\nEn général, la chaîne d'effets était la suivante&nbsp;: exposition (courbes), Dust Buster (au besoin), netteté/flou (au besoin), Dehancer Pro (look film, grain, bloom, vignette etc), pour finir avec un effet noir et blanc.\n\n\nPour l'occasion, un nouveau montage d'images de la ville accompagnées de bruits de frénésie urbaine fut ajouté au début du montage, en guise de mise en situation. C'est le seul endroit où cette version dévie de l'originale au point de vue éditorial. \n\nPuisqu'on passait d’un faux 16:9 sur un écran 4:3 à un vrai 16:9, j'ai choisi de tout de même garder de légères barres noires au haut et au bas de l'écran pour intentionnellement conserver cet artifice visuel présent dans la version originale.\n\n\n### Corriger les «&nbsp;dropouts&nbsp;»\n\nQuelques plans ici et là contenaient des imperfections que je classerait dans trois catégories&nbsp;: les plis dans la ruban de la cassette de tournage, les comètes (type de dropout analogique) et les dropouts numériques introduits en cours de route. \n\n<img src = \"/blogs/freak_like_the_rest/dropouts.webp\" alt=\"Exemples des trois types de dropouts rencontrés\">\n<br/>\n\nLes plis de ruban apparaissant comme une ligne horizontale complète de l'image qui est dupliquée et qui se déplace vers le bas sur plusieurs images consécutives. Il faut généralement utiliser une partie d'une image voisine pour la recouvrir et cacher le problème. En convertissant la source 30i en 60p, on obtient un plus grand choix d'images complètes avec lesquelles effectuer ces réparations sur la séquence 24p.\n\nLes comètes apparaissaient comme de petits points blancs suivis d'une traînée causés par une interférence électrique. Normalement, ils sont assez simples à corriger avec l'effet «&nbsp;Dust Buster&nbsp;» de Resolve mais dans ce cas, la conversion implicite de 30i à 60p ayant lieu pour se rendre à 24p m'a donné du fil à retordre. Au niveau du Dust Buster, les champs paires et impaires sont tous deux identifiés par le même code temporel, causant les corrections à souvent ne pas être visibles au rendu final. La solution fut de forcer le rendu, créant un nouveau clip... Si c'était à refaire, je commencerais peut-être par une conversion 60p pour tout le matériel avant même d'entreprendre le montage. De cette façon, chaque image aurait son propre code temporel et j'éviterais ce genre d'ennui.\n\n<img src = \"/blogs/freak_like_the_rest/pierre.webp\" alt=\"Exemple de dropout numérique extrème\">\n<br/>\n\nLe dernier type d'erreur était un type de dropout numérique affectant une grande partie de l'image. Celui-ci était causé par un problème de lecture de l'enregistrement analogique durant les séquences où la caméra avait été secouée durant l’enregistrement même. À l'étape du transfert numérique, le lecteur Digital-8 ne pouvant pas lire toute l'information, une partie de l'image (voir même plusieurs images complètes) était reproduite à partir d'une image précédente.\n\nDans ces cas, il fallait réparer les trous (ou l'image complète) avec le master S-VHS. En plus de la perte de génération, la nouvelle image ne pouvait pas être recadrée puisque les «&nbsp;bretelles 16:9&nbsp;» étaient déjà présentes, et les égratignures de film aussi. Mis-à part les problèmes cités plus tôt, Dust Buster était tout de même très utile à réparer ces égratignures.\n\n\n### Un dernier problème technique&nbsp;: Le zoom numérique\n\nÀ trois ou quatre endroits spécifiques dans la vidéo, le zoom numérique 1.5x de la caméra RCA avait été utilisé au tournage, donnant une image d'une résolution d'environs 480x320. L'option de n'utiliser ici que le centre de l'écran (480x228) était donc impensable. La solution fût d'utiliser la pleine hauteur de l'image et d'étirer les cotés droit et gauche de l'image de façon à en faire une image 16:9 sans déformer le point central de l'image. \n\n<img src = \"/blogs/freak_like_the_rest/course_combo.webp\" alt=\"Avant/Après recadrage\">\n<br/>\n\nPour les intéressés, voici le lien vers le  <a href=\"https://www.youtube.com/watch?v=_ASAF1Y3_uU\" target=\"_blank\"> tutoriel et preset Fusion gratuit</a> utilisé (pour Resolve).\n\n\n## Le résultat final\n\n<VideoPlayer src=\"https://player.vimeo.com/video/1011487924?h=d4a2cd0241\" />\n\nPersonnellement, je suis très heureux du résultat. J'ai toujours été fier de cette production pour son tournage guérilla, son énergie et son humour. Après plus de 25 ans, de pouvoir vous la présenter en haute définition, toute neuve, comme si elle avait été tournée la semaine dernière, me fait énormément plaisir. \n\nLes anciens membres du groupe Treebeard ont comparé cette nouvelle version comme un «&nbsp;voyage dans le temps&nbsp;», et je crois qu'ils avaient raison.\n\n\n\n"
  },
  {
    "id": "bienvenue-sur-mon-nouveau-site-web-!",
    "title": "Bienvenue sur mon nouveau site web !",
    "author": "Mathieu Lalonde",
    "photo": "blogs/selfie_lg.webp",
    "abstract": "C'est aujourd'hui le grand jour; la nouvelle mouture de mathieulalonde.com est enfin là.",
    "postDate": "2024-05-15",
    "categories": [
      "general",
      "web",
      "tech"
    ],
    "content": "\n*3... 2... 1... c'est parti !!*\n\nLes blogs précédents y on parfois fait allusion mais on voit finalement où tout s'en allait...\n\nC'est aujourd'hui le grand jour; la nouvelle mouture de *mathieulalonde.com* est enfin là; un site qui reflète aussi bien mon amour pour l'informatique que mes débuts avec la vidéo analogique. \n\nCe nouveau site m'a effectivement permit de découvrir de nouvelles technologies, de me rafraîchir la mémoire sur d'autres et d'approfondir mes connaissances sur celles qui m'étaient déjà familières.\n\n\n## Une évolution progressive\n\n\n<!--<img src = \"/blogs/sites_web/site_mjl.webp\" alt=\"Mon premier site web\" className=\"blogphoto\">-->\n<img src = \"/blogs/sites_web/site_impact.webp\" alt=\"Le site web d'Impact Video, circa 1998\" className=\"blogphoto\">\n<figcaption>Le site web d'Impact Video, circa 1998. Impact Vidéo (anciennement ECC Vidéo) était une compagnie fondée par Mathieu Lalonde et Christian Coulombe, se spécialisant dans les tournages vidéo multi-caméra et la construction de sites web.</figcaption>\n\n\nCe fut un long parcours depuis mon premier site construit dans *Corel Web.Designer* (la version démo où on n'avait qu'à effacer une clé dans *RegEdit* pour remettre son compteur à zéro), puis les *DreamWeaver* et *HomeSite*, les *Joomla* et les *Flask (Python)* dans *VS Code*... Mais on y est enfin arrivé.\n\n\nConçu dans *React* (*Typescript*) avec *Vite*, un blog *Markdown*, *Sass-y CSS*, *PostCSS*, *SVG*, *Git* et un tas d'autres acronymes difficiles à prononcer... mathieulalonde.com entre dans l'ère moderne !\n\n## Pour la suite\n\nJ'ai encore plein d'idées de trucs à ajouter au site alors c'est pas fini. Et y'a pas seulement que le site, non plus! Pour continuer d'aller de l'avant, ce blogue me permettra de continuer d'explorer mes projets intérêts et de vous partager mes découvertes. \n\nRevenez me voir de temps en temps; j'suis pas sorteux!"
  },
  {
    "id": "creer-un-glitch-en-css-et-svg-(et-un-peu-de-react)",
    "title": "Créer un glitch en CSS et SVG (et un peu de React)",
    "author": "Mathieu Lalonde",
    "photo": "blogs/glitch_1/glitchy_logo_xcu.webp",
    "abstract": "Aujourd'hui, « j'ajoute des bogues » dans mon site avec cet effet de glitch !",
    "postDate": "2024-05-03",
    "categories": [
      "css",
      "svg",
      "react",
      "top3"
    ],
    "content": "\n\nIl y a déjà quelques années de cela, j'ai eu à créer un effet de &laquo;&nbsp;glitch&nbsp;&raquo; pour l'une de mes vidéos. Le résultat en fut un effet subtile qui ajoute un peu de tension et d'énergie, sans être trop criant ou tape-à-l’œil.\n\nCette fois-ci, mon objectif était donc de recréer cet effet dans le contexte d'un site web.\n\n## L'effet original\n\nÀ la base l'effet original consiste à brièvement découper l'image ou le texte en tranches et d'en déplacer quelques unes vers la gauche et d'autres vers la droite.\n\nDans *Avid Media Composer*, j'ai utilisé l'effet &laquo;&nbsp;Scratch Removal&nbsp;&raquo; pour déplacer des tranches d'image de 3 à 4 pixels dans une direction ou l'autre.\n\n<img src = \"blogs/glitch_1/glitch_avid.webp\" alt=\"Le glitch dans Avid Media Composer\" className=\"blogphoto\">\n\nL'effet peut ensuite être placé pour une durée d'une image, n'importe où dans le montage.\n\n\n## Se préparer à recréer l'effet en CSS\n\nPour recréer l'effet en CSS, il faut s'y prendre un peu différemment. Puisqu'on ne peut pas réellement *découper* en élément en deux, il faut donc en créer une copie et ensuite masquer chaque version de façon à créer un casse-tête qui peut être reconstruit.\n\nLa première est a donc de créer trois éléments textuels identiques. Pour mieux m'aider à voir ce que je faisait au cours des prochaines étapes, je leur ai donné des couleurs différentes.\n\nJe l'ai ai ensuite superposés à l'aide d'une grille, me donnant quelque chose comme ceci :\n\n```html\n<div class=\"glitch\">\n    <h1 class=\"glitch__mask1\">bonjour</h1>\n    <h1 class=\"glitch__mask2\">bonjour</h1>\n    <h1 class=\"glitch__background\">bonjour</h1>\n</div >\n```\n```css\n.glitch {\n  display: grid;\n  grid-template: 1fr / 1fr;\n}\n\n.glitch > * {\n  grid-column: 1 / 1;\n  grid-row: 1 / 1;\n  place-items: center;\n}\n\n.glitch__mask1 {\n  color: yellowgreen;\n}\n\n.glitch__mask2 {\n  color: blueviolet;\n}\n```\n\nÀ ce point-ci, les deux premiers &laquo;&nbsp;bonjour&nbsp;&raquo; sont donc complètement recouverts par le troisième.\n\nEn ajoutant un ` margin-left: 15px ` ou ` -15px `, à certaines couches, on peut mieux les voir :\n\n<img src = \"blogs/glitch_1/bonjour_couleur.webp\" alt=\"Le mot Bonjour triplé\">\n\nOn peut maintenant passer à la prochaine étape; la création des masques...\n\n## Créer les masques SVG\n\nDans *<a href='https://inkscape.org/' target='_blank'>Inkscape</a>*, j'ai créé une nouvelle image sur laquelle j'ai dessiné des rectangles de deux couleurs différentes. L'une de ces couleurs servira au déplacement vers la gauche et l'autre vers la droite.\n\n<img src = \"blogs/glitch_1/glitch_inkscape.webp\" alt=\"Créer le SVG dans Inskscape\" className=\"blogphoto\">\n\nOn peut donc effacer l'une des deux couleurs, sauvegarder un fichier *.svg*, revenir en arrière et faire la même chose pour l'autre couleur. \n\nLorsque c'est le temps de créer le masque pour l'arrière plan (la partie de l'image qui ne bougera pas), je crée un grand rectangle qui couvre tout le canevas et, en le sélectionnant en combinaison avec l'un des rectangles précédents, dans le menu `Path`, je sélectionne `Difference`. Il faut ensuite répéter l'opération pour retirer la forme de chaque rectangle de l'arrière plan avant de sauvegarder un troisième *SVG*.\n\n<!--Outset-->\n<!--It's in program preferences. See category \"Behaviour\". In subcategory \"Steps\" there's a variable for Inset/Outset step.  => j'ai choisi 0.5px, j;aurais du prendre 1px-->\n\n<!--Clip to page size using another rectangle:-->\n<!--https://graphicdesign.stackexchange.com/questions/42529/how-do-i-remove-parts-of-a-svg-that-arent-on-the-page-->\n\n\nÀ ce point-ci, nous avons trois *SVG* complémentaires :\n\n<div style='display: flex'>\n<img src = \"blogs/glitch_1/glitch1.svg\" alt=\"\" style='width: 33%; padding-inline: 1rem'>\n<img src = \"blogs/glitch_1/glitchbg.svg\" alt=\"\" style='width: 33%; padding-inline: 1rem'>\n<img src = \"blogs/glitch_1/glitch2.svg\" alt=\"\" style='width: 33%; padding-inline: 1rem'>\n</div>\n\n\n## Appliquer les masques sur le texte\n\nOn peut donc appliquer les masques SVG sur les différentes couches :\n\n```CSS\n.glitch__mask1 {\n  -webkit-mask-image: url(../assets/glitch1.svg);\n  mask-image: url(../assets/glitch1.svg);\n}\n\n.glitch__mask2 {\n  -webkit-mask-image: url(../assets/glitch2.svg);\n  mask-image: url(../assets/glitch2.svg);\n}\n\n.glitch__background {\n  -webkit-mask-image: url(../assets/glitchbg.svg);\n  mask-image: url(../assets/glitchbg.svg);\n}\n```\n\nC'est possible qu'à ce point-ci, seulement un (ou aucun) des masques n'ait un effet sur le texte utilisé. Si c'est le cas, c'est probablement une question de la position du masque en relation avec le texte. Ajoutez `mask-position` et/ou `mask-size` dans `.glitch > * ` pour repositionner tous les masques.\n\n<img src = \"blogs/glitch_1/bonjour_glitch_couleur.webp\" alt=\"Exemple du glitch sur le mot Bonjour\">\n\n\nEt voilà ! Si on enlève les couleur temporaires, il est maintenant possible d'utiliser l'effet tel quel pour créer ce qui ressemble à une nouvelle police typographique. Mais bon, on ne va pas s'arrêter là...\n\n\n## Animer le glitch\n\nLa prochaine étape consiste à animer les marges des couches `glitch__mask1` et `2` en créant des `keyframes`.\n\n```css\n@keyframes glitch1 {\n  4%, 7.5%, 19%, 21% {\n    margin-left: 0;\n    margin-right: 0;\n  }\n  5%, 20% {\n    margin-left: -4px;\n    margin-right: 4px;\n  }\n}\n\n@keyframes glitch2 {\n  4%, 6%, 19%, 22.5% {\n    margin-left: 0;\n    margin-right: 0;\n  }\n  5%, 20% {\n    margin-left: 4px;\n    margin-right: -4px;\n  }\n}\n```\n\nD'augmenter les marges d'un côté ou de l'autre d'un texte ou d'une image peut avoir des conséquences inattendues. Par exemple, une image pourrait devenir moins haute pour compenser ou un texte se propager sur une ligne supplémentaire.\n\nDonc pour éviter de modifier toute mise en page à chaque pulsation du &laquo;&nbsp;glitch&nbsp;&raquo;, j'ai ajouté une marge de taille inverse du côté opposé. De cette façon, il y a un déplacement lattéral mais tout reste en place.\n\nOn peut ensuite appliquer les animations sur les couches. J'ai choisi d'utiliser une animation de 8 secondes; pour une animation d'une durée différente, il faudrait ajuster les pourcentages des `keyframes` en conséquence.\n\n```css\n.glitch__mask1 {\n  -webkit-mask-image: url(../assets/glitch1.svg);\n  mask-image: url(../assets/glitch1.svg);\n\n  animation-name: glitch1;\n}\n\n.glitch__mask2 {\n  -webkit-mask-image: url(../assets/glitch2.svg);\n  mask-image: url(../assets/glitch2.svg);\n\n  animation-name: glitch2;\n}\n\n.glitch__mask1,\n.glitch__mask2 {\n  animation-duration: 8s;\n  animation-timing-function: steps(1, jump-both);\n  animation-iteration-count: infinite;\n}\n```\n\nOn peut également retirer `place-items: center;` de `.glitch` puis qu'il peut avoir des effets secondaires indésirés. Il est mieux de ne centrer les éléments qu'au besoin.\n\n\n<!--Pour une raison, l'effet ne fonctionnait que sur les pages /, ajouter <base href=\"/\" /> dans head 'a la racine a r/solu le proble'me-->\n\n\n<!--Essaie de l'ajouter à mon animation d'intro-->\n<!--Type 'String' is not assignable to type 'Element | Element[]'.-->\n<!--  Type 'String' is missing the following properties from type 'Element[]': pop, push, join, reverse, and 21 more.ts(2322)-->\n \n<!-- Convierti -->\n \n<!--    const words: String[] = [\"Créer.\", \"Coder.\", \"Communiquer.\", \"Collaborer.\", \"Captiver.\", \"Concevoir.\"];-->\n \n<!-- À-->\n \n<!--    const words: JSX.Element[] = [<>Créer.</>, <>Coder.</>, <>Communiquer.</>, <>Collaborer.</>, <>Captiver.</>, <>Concevoir.</>];-->\n    \n<!--    Mais il reste juste le shadow, je n'ai plus le matte.-->\n    \n<!--    Je ne peut pas mettre de masque par dessus un masque. Il faudrait animer le premier masque, c'est à dire, le texte original.-->\n\n   \n<Glitch><h1 style='font-size: 10rem' className=\"center\">bonjour</h1></Glitch>\n    \n    \n\nEt comme pour chaque animation, c'est toujours une bonne idée de respecter l'option `prefers-reduced-motion` :\n\n```css\n@media (prefers-reduced-motion) {\n  .glitch__mask1,\n  .glitch__mask2 {\n    animation-name: none;\n  }\n}\n```\n    \n## Si on utilise React\n\nOptionnellement, on peut créer un composant *React* à partir de l'effet, il peut maintenant être appliqué presque n'importe où en ajoutant une paire de balises `<Glitch>` autour du texte ou de l'image voulue.\n\n```jsx\ninterface Props {\n  children: JSX.Element | JSX.Element[];\n};\n\nconst Glitch = ({ children }: Props) => {\n  return (\n    <div className=\"glitch\">\n      <div className=\"glitch__background\">{children}</div>\n      <div className=\"glitch__mask1\" aria-hidden=\"true\">{children}</div>\n      <div className=\"glitch__mask2\" aria-hidden=\"true\">{children}</div>\n    </div >);\n};\n\nexport default Glitch\n```\n\nCeci rend son utilisation *beaucoup* plus simple puisqu'il n'est plus nécessaire de dupliquer quoi que ce soit&nbsp; avant de l'appliquer sur du texte, un logo ou une photo :\n\n<Glitch><img src=\"blogs/sourire.webp\" alt=\"Un joyeux animal\" style='width: 80%' className=\"blogphoto\"></Glitch>\n    \n    \n\n\n\n"
  },
  {
    "id": "recreer-un-effet-vhs-en-css-et-svg.",
    "title": "Recréer un effet VHS en CSS et SVG.",
    "author": "Mathieu Lalonde",
    "photo": "blogs/vhs_play/vhs_cu.webp",
    "abstract": "Comment recréer un effet de chargement de cassette VHS, style 1991.",
    "postDate": "2024-04-05",
    "categories": [
      "css",
      "svg",
      "top3"
    ],
    "content": "\nVoici un effet intéressant que j'ai créé en travaillant sur la nouvelle version de mon site web (et son incorporation de fichiers vidéos). Il m'est donc passé par la tête de recréer pour le web, un effet de chargement de cassette VHS, circa 1991.\n\n<img src = \"/blogs/vhs_play/vhs_ws.webp\" alt=\"Play en lettres blanches sur fond bleu\" className=\"blogphoto\">\n\nLe processus qui suit est tout de même plutôt simple mais c'est la concaténation de plusieurs petits détails qui aident à vraiment donner de la crédibilité à l'effet.\n\n<!--(Pour ceux qui sont trop jeunes pour l'avoir connu (ou trop vieux pour s'en souvenir), voici un exemple retrouvé sur YouTube qui illustre assez bien ce que j'avais en tête : )-->\n\n<!--<VideoPlayer src=\"https://www.youtube-nocookie.com/embed/_c2V75k-ilQ?si=llNZsuKC7V7sK7ld\" />-->\n\n## L'arrière plan\n\nDans un fichier CSS, j'ai tout d'abord commencé avec un fond bleu, plein écran. Pour ajouter un peu de profondeur, j'ai ajouté un gradient radial, question de simuler un tube à rayons cathodique bombé (et un peu mal calibré) :\n\n```CSS\nhtml,\nbody {\n  background: radial-gradient(circle, #0000ff 0%, #2119c4 60%, #280970 100%)\n}\n```\n\n\n## Créer le texte\n\nPour le texte « PLAY » lui même, j'ai choisi la typo \n[VCR OSD Neue](https://www.dafont.com/vcrosdneue.font) mais vraiment n'importe quel typo du genre aurait pu faire l'affaire.\n\nÀ ce point-ci, j'avais un choix à faire : convertir le texte en un élément graphique ou non. En version texte, il serrait facilement remplaçable et modifiable mais j'aurais tout d'abord à convertir la typo **TrueType** en **.woff** et la publier sur le serveur pour, en bout de ligne, n'afficher que quatre lettres. J'ai donc opté pour convertir le texte en **SVG** à la place.\n\nDans *Photoshop*, tout d'abords créé une page vide et tapé le texte voulu puis. \n\nAttention : ici, l'option `Copy SVG` nous exportera un fichier SVG qui fait essentiellement la même chose que d'écrire le texte dans un document HTML. À l'autre extrême, si on utilise `Rasterise Type` avant de copier le texte, on obtiendra une image PNG complète encodé en base 64 à même le fichier SVG.\n\nIl faut donc utiliser l'option `Convert to Shape` qui, avant de copier vers SVG, convertira le texte en image vectorielle.\n\n<img src = \"blogs/vhs_play/vhs_play-plain.svg\" alt=\"PLAY en lettres blanches pixélisée\">\n\n### Note:\nAu lieu d'utiliser Photoshop, il est possible d'effectuer les mêmes démarches avec le logiciel gratuit [Inkskape](https://inkscape.org/). Le résultat contiendra cependant plusieurs lignes de métadonnées supplémentaires. Un point positif, c'est que chaque lettre sera isolée dans son propre `path`, permettant éventuellement des manipulations plus granulaires.\n\n\n\n## Incorporer et animer le texte\n\nPour toujours garder la taille du texte relativement la même à l'écran, peu importe l'orientation, j'utilise un `width: max(10vw, 20vh)`.\n\nJe crée également une petite animation pour simuler rapidement un peu d'interférence. \n\nPuisqu'un signal vidéo analogique NTSC est composé de 486 lignes de résolution verticales et une résolution horizontale qui varie selon la qualité du signal, cette distorsion n'a uniquement lieu qu'en termes de déplacements horizontaux aléatoires. Mais, en bout de ligne, ce n'est que l'impression générale qui compte ici.\n\n```CSS\n\n@keyframes glitch {\n  10% {\n    transform: translate(-0.5px, 0) skew(0deg);\n  }\n  27% {\n    transform: translate(1px, 0) skew(1deg);\n  }\n  30% {\n    transform: translate(-1px, 0) skew(1deg);\n  }\n  47% {\n    transform: translate(0.5px, 0) skew(0.5deg);\n  }\n  50% {\n    transform: translate(-0.5px, 0) skew(0.5deg);\n  }\n  67% {\n    transform: translate(0px, 0) skew(0deg);\n  }\n  70% {\n    transform: translate(-0.5px, 0) skew(0.5deg);\n  }\n  87% {\n    transform: translate(1px, 0) skew(1deg);\n  }\n  90% {\n    transform: translate(-2px, 0) skew(2deg);\n  }\n  100% {\n    transform: translate(1px, 0) skew(1deg);\n  }\n}\n\n.vhs_play {\n  width: max(10vw, 20vh);\n  padding: 6%;\n  opacity: 90%;\n  \n  animation: glitch 1s linear infinite alternate;\n}\n```\n\n## Flouter le texte\n\nÀ ce point-ci, tout a l'air trop propre. J'ai donc ajouté un flou horizontal pour simuler une perte de résolution. Il s'agit d'un effet plus simple à recréer en directement en SVG qu'en CSS alors je l'ai appliqué à même le fichier SVG.\n\nEn même temps, j'ai ajouté une ombre magenta pour dégrader l'image davantage.\n\n```SVG\n   <defs>\n      <filter id=\"blur\">\n         <feGaussianBlur in=\"SourceGraphic\" stdDeviation=\"20, 0\" />\n      </filter>\n\n      <filter id='shadow' color-interpolation-filters=\"sRGB\">\n         <feDropShadow dx=\"-15\" dy=\"0\" stdDeviation=\"3\" flood-opacity=\"1\" flood-color=\"red\"/>\n      </filter>\n      \n   </defs>\n```\n\net `style=\"filter: url(#blur) url(#shadow)\"` à l'élément `path` du même SVG. Ça donne ceci :\n\n<img src = \"blogs/vhs_play/vhs_play.svg\" alt=\"PLAY flou avec légère séparation des couleurs\">\n\n## Les petits détails\n\nJ'aurais pu arrêter ici mais j'ai décidé d'ajouter quelques petits détails pour bien vendre le look:\n\n### La demi-ligne\n\nLe premier est quasiment subliminal; il s'agit de la demi-ligne noire au bas droit de l'écran. Dans un signal analogique, la dernière ligne au bas de l'écran n'est qu'une demie ligne. Ceci est parfois visible lorsqu'on visionne une vielle vidéo sur un écran d'ordinateur -- cette partie de l'image aurait normalement été cachée par les rebords du téléviseur.\n\nEt bien sûr, cette ligne a sa propre animation bien à elle. \n\n### Les lignes de balayage\n \nJ'ai aussi adapté un *look* lignes de résolution à partir de celui de [@meduzen](https://codepen.io/meduzen/pen/zxbwRV) en ne conservant que l'essentiel.\n \n\n## Une dernière chose\n\nFinalement, j'ai créé une deuxième animation pour ajouter un délais d'une demi-seconde avant l'apparition du &laquo;&nbsp;play&nbsp;&raquo; à l'écran :\n\n```CSS\n@keyframes wait_start {\n  0% {\n    opacity: 0%;\n  }\n  90% {\n    opacity: 0%;\n  }\n  100% {\n    opacity: 90%;\n  }\n}\n```\n\n<div className=\"videocontainer\"><iframe className=\"videoplayer\" src=\"/blogs/vhs_play/index.html\"} /></div>\n\n\n<a href=\"/blogs/vhs_play/index.html\" target=\"_blank\">Cliquez ici pour le voir plein écran.</a>\n\n## Le code final\n\nVoici donc à quoi ressemble le code final :\n\n```html\n<!DOCTYPE html>\n<html lang=\"en\">\n  <head>\n    <meta charset=\"UTF-8\" />\n  </head>\n  <body>\n      <!-- Loading screen -->\n      <link rel=\"stylesheet\" href=\"./vhs_play.css\" />\n      <div class=\"scanlines\">\n        <img src=\"./vhs_play.svg\" class=\"vhs_play\" />\n        <div class=\"vhs_halfline\"></div>\n      </div>\n      <!-- End of loading screen -->\n  </body>\n</html>\n```\n\n```css\nhtml,\nbody {\n  margin: 0;\n  height: 100%;\n  background: radial-gradient(circle, #0000ff 0%, #2119c4 60%, #280970 100%);\n  overflow: hidden; \n}\n\n@keyframes wait_start {\n  0% {\n    opacity: 0%;\n  }\n  90% {\n    opacity: 0%;\n  }\n  100% {\n    opacity: 90%;\n  }\n}\n\n@keyframes glitch {\n  10% {\n    transform: translate(-0.5px, 0) skew(0deg);\n  }\n  27% {\n    transform: translate(1px, 0) skew(1deg);\n  }\n  30% {\n    transform: translate(-1px, 0) skew(1deg);\n  }\n  47% {\n    transform: translate(0.5px, 0) skew(0.5deg);\n  }\n  50% {\n    transform: translate(-0.5px, 0) skew(0.5deg);\n  }\n  67% {\n    transform: translate(0px, 0) skew(0deg);\n  }\n  70% {\n    transform: translate(-0.5px, 0) skew(0.5deg);\n  }\n  87% {\n    transform: translate(1px, 0) skew(1deg);\n  }\n  90% {\n    transform: translate(-2px, 0) skew(2deg);\n  }\n  100% {\n    transform: translate(1px, 0) skew(1deg);\n  }\n}\n\n@keyframes jitter {\n  10% {\n    width: calc(50% + 1px);\n  }\n  28% {\n    width: calc(50% - 1px);\n  }\n  30% {\n    width: calc(50% + 2px);\n  }\n  48% {\n    width: 50%;\n  }\n  50% {\n    width: calc(50% + 3px);\n  }\n  68% {\n    width: calc(50% - 1px);\n  }\n  70% {\n    width: calc(50% + 2px);\n  }\n  88% {\n    width: 50%;\n  }\n  90% {\n    width: calc(50% + 2px);\n  }\n  100% {\n    width: 50%;\n  }\n}\n\n.vhs_play {\n  width: max(10vw, 20vh);\n  padding: 6%;\n  opacity: 90%;\n\n  animation-name: glitch, wait_start;\n  animation-duration: 1s, 0.5s;\n  animation-timing-function: steps(59.976);\n  animation-iteration-count: infinite, 1;\n  animation-iteration-count: alternate, steps(29.97);\n}\n\n.vhs_halfline {\n  position: absolute;\n  top: calc(100% - 3px);\n  right: 0;\n  width: 50%;\n  height: 5px;\n  background: rgb(0, 0, 0);\n\n  animation: jitter 0.5s steps(29.97) infinite alternate;\n}\n\n\n/* Adapted from scanlines at https://codepen.io/meduzen/pen/zxbwRV */\n .scanlines:after {\n\t display: block;\n\t pointer-events: none;\n\t content: '';\n\t position: absolute;\n\t top: 0;\n\t right: 0;\n\t bottom: 0;\n\t left: 0;\n\t z-index: 2147483648;\n\t background: linear-gradient(to bottom, transparent 50%, rgba(0, 0, 0, .15) 51%);\n\t background-size: 100% 4px;\n}\n```\n\n\n```svg\n<svg \n xmlns=\"http://www.w3.org/2000/svg\"\n xmlns:xlink=\"http://www.w3.org/1999/xlink\"\n width=\"1619px\"\n height=\"510px\"\n viewBox=\"-100 0 1819 510\"\n >\n\n   <defs>\n      <filter id=\"blur\">\n         <feGaussianBlur in=\"SourceGraphic\" stdDeviation=\"20, 0\" />\n      </filter>\n\n      <filter id='shadow' color-interpolation-filters=\"sRGB\">\n         <feDropShadow dx=\"-15\" dy=\"0\" stdDeviation=\"3\" flood-opacity=\"1\" flood-color=\"red\"/>\n      </filter>\n      \n   </defs>\n\n   <path\n      fill-rule=\"evenodd\" \n      fill=\"rgb(255, 255, 255)\" \n      style=\"filter: url(#blur) url(#shadow)\"\n      d=\"M1573.434,231.804 L1573.434,278.081 L1527.157,278.081 L1527.157,324.359 L1480.880,324.359 L1480.880,370.636 L1480.880,416.913 L1480.880,463.190 L1480.880,509.467 L1434.603,509.467 L1388.326,509.467 L1388.326,463.190 L1388.326,416.913 L1388.326,370.636 L1388.326,324.359 L1342.048,324.359 L1342.048,278.081 L1295.771,278.081 L1295.771,231.804 L1249.494,231.804 L1249.494,185.527 L1249.494,139.250 L1249.494,92.973 L1249.494,46.696 L1249.494,0.419 L1295.771,0.419 L1342.048,0.419 L1342.048,46.696 L1342.048,92.973 L1342.048,139.250 L1342.048,185.527 L1388.326,185.527 L1388.326,231.804 L1434.603,231.804 L1480.880,231.804 L1480.880,185.527 L1527.157,185.527 L1527.157,139.250 L1527.157,92.973 L1527.157,46.696 L1527.157,0.419 L1573.434,0.419 L1619.711,0.419 L1619.711,46.696 L1619.711,92.973 L1619.711,139.250 L1619.711,185.527 L1619.711,231.804 L1573.434,231.804 ZM1110.663,509.467 L1110.663,463.190 L1110.663,416.913 L1110.663,370.636 L1064.386,370.636 L1018.109,370.636 L971.831,370.636 L925.554,370.636 L925.554,416.913 L925.554,463.190 L925.554,509.467 L879.277,509.467 L833.000,509.467 L833.000,463.190 L833.000,416.913 L833.000,370.636 L833.000,324.359 L833.000,278.081 L833.000,231.804 L833.000,185.527 L833.000,139.250 L879.277,139.250 L879.277,92.973 L925.554,92.973 L925.554,46.696 L971.831,46.696 L971.831,0.419 L1018.109,0.419 L1064.386,0.419 L1064.386,46.696 L1110.663,46.696 L1110.663,92.973 L1156.940,92.973 L1156.940,139.250 L1203.217,139.250 L1203.217,185.527 L1203.217,231.804 L1203.217,278.081 L1203.217,324.359 L1203.217,370.636 L1203.217,416.913 L1203.217,463.190 L1203.217,509.467 L1156.940,509.467 L1110.663,509.467 ZM1110.663,231.804 L1110.663,185.527 L1064.386,185.527 L1064.386,139.250 L1018.109,139.250 L971.831,139.250 L971.831,185.527 L925.554,185.527 L925.554,231.804 L925.554,278.081 L971.831,278.081 L1018.109,278.081 L1064.386,278.081 L1110.663,278.081 L1110.663,231.804 ZM694.169,509.467 L647.891,509.467 L601.614,509.467 L555.337,509.467 L509.060,509.467 L462.783,509.467 L416.506,509.467 L416.506,463.190 L416.506,416.913 L416.506,370.636 L416.506,324.359 L416.506,278.081 L416.506,231.804 L416.506,185.527 L416.506,139.250 L416.506,92.973 L416.506,46.696 L416.506,0.419 L462.783,0.419 L509.060,0.419 L509.060,46.696 L509.060,92.973 L509.060,139.250 L509.060,185.527 L509.060,231.804 L509.060,278.081 L509.060,324.359 L509.060,370.636 L509.060,416.913 L555.337,416.913 L601.614,416.913 L647.891,416.913 L694.169,416.913 L740.446,416.913 L786.723,416.913 L786.723,463.190 L786.723,509.467 L740.446,509.467 L694.169,509.467 ZM323.952,278.081 L277.674,278.081 L231.397,278.081 L185.120,278.081 L138.843,278.081 L92.566,278.081 L92.566,324.359 L92.566,370.636 L92.566,416.913 L92.566,463.190 L92.566,509.467 L46.289,509.467 L0.012,509.467 L0.012,463.190 L0.012,416.913 L0.012,370.636 L0.012,324.359 L0.012,278.081 L0.012,231.804 L0.012,185.527 L0.012,139.250 L0.012,92.973 L0.012,46.696 L0.012,0.419 L46.289,0.419 L92.566,0.419 L138.843,0.419 L185.120,0.419 L231.397,0.419 L277.674,0.419 L323.952,0.419 L323.952,46.696 L370.229,46.696 L370.229,92.973 L370.229,139.250 L370.229,185.527 L370.229,231.804 L323.952,231.804 L323.952,278.081 ZM277.674,139.250 L277.674,92.973 L231.397,92.973 L185.120,92.973 L138.843,92.973 L92.566,92.973 L92.566,139.250 L92.566,185.527 L138.843,185.527 L185.120,185.527 L231.397,185.527 L277.674,185.527 L277.674,139.250 Z\"\n      />\n</svg>\n```"
  },
  {
    "id": "quelques-facons-alternatives-de-presenter-son-cv.",
    "title": "Quelques façons alternatives de présenter son CV.",
    "author": "Mathieu Lalonde",
    "photo": "blogs/cv_booklet/Outside_Mockup.webp",
    "abstract": "Dans le cadre d'une offre d'emploi récemment publiée sur LinkedIn, unemployeur demandait à ses candidats de fournir deux choses qui sortent légèrement de l'ordinaire.",
    "postDate": "2024-03-05",
    "categories": [
      "general",
      "montage",
      "graphisme"
    ],
    "content": "\nDans le cadre d'une offre d'emploi récemment publiée sur LinkedIn, l'employeur (une grande agence publicitaire), demandait à ses candidats de fournir deux choses qui sortent légèrement de l'ordinaire.\n\nLa première était de répondre à la question&nbsp;: «&nbsp;Qu'est-ce qui me passionne&nbsp;?&nbsp;», et la deuxième était de fournir un CV &laquo;&nbsp;atypique&nbsp;&raquo;. Ces deux items pouvaient être fournis sous une multitudes de formats différents, des plus ordinaires aux plus farfelus. Et puisque l'un d'entre eux était de soumettre une vidéo... je me suis senti obligé de le faire, bien sûr !\n\n## La vidéo\n\nJ'ai tout d'abord songé à présenter mon CV sous forme de vidéo mais la limite de temps stipulée d'une minute me semblait un peu trop contraignante. J'ai donc opté pour parler de ma passion pour l'informatique en utilisant ce médium.\n\n<VideoPlayer src=\"https://www.youtube-nocookie.com/embed/DXUfddvlo8Q?si=0W6tFwgVAGDSc1o7\" />\n\nLe montage est fortement inspiré de ma dernière démo de monteur et récupère une partie de ce tournage pour en faire quelque chose complètement différent qui me présente sous toutes mes facettes.\n\n## Le livret\n\nPour le CV lui-même, j'ai pensé le créer sous la forme d'un livret livret carré, un peu comme ceux que l'on retrouverait dans le boîtier d'un disque compact.\n\n<img src = \"/blogs/cv_booklet/Cover_Mockup.webp\" alt=\"Mon CV sous forme de livret\" className=\"blogphoto\">\n<img src = \"/blogs/cv_booklet/Outside_Mockup.webp\" alt=\"Mon CV sous forme de livret - ouvert\"     className=\"blogphoto\">\n<img src = \"/blogs/cv_booklet/Inside_Mockup_6-7.webp\" alt=\"L'intérieur du livret\" className=\"blogphoto\">\n<img src = \"/blogs/cv_booklet/Inside_Mockup_10-11.webp\" alt=\"L'intérieur du livret\" className=\"blogphoto\">\n\nNon, je ne suis pas sur le point de lancer un album de chansons ... mais voici à quoi mon CV ressemblerait dans un boîtier à CD :\n\n<img src = \"/blogs/cv_booklet/Box_Mockup.webp\" alt=\"Le livret à l'intérieur d'un boiter à CD\" className=\"blogphoto\">\n\n## Téléchargement\n\nVoici le <a href=\"/blogs/cv_booklet/CV_Mathieu_Lalonde(livret).pdf\" target=\"_blank\"> PDF du CV complet</a> à télécharger. Notez-bien que, contrairement à mon résumé standard, celui-ci ne sera pas continuellement mis à jour...\n\nAlors, qu'en pensez-vous ? C'est une bonne idée ?\n\nPersonnellement, je trouve ça un peu dommage que les copies de CV physiques soient chose du passé. Mais pas trop."
  },
  {
    "id": "lars-von-trier-l'ultime-cineaste-allemand",
    "title": "Lars von Trier, l'ultime cineaste «allemand» ? ",
    "author": "Mathieu Lalonde",
    "photo": "blogs/europa/mort.webp",
    "abstract": "Un regard sur Europa (1991) et comment ce film réussit à résumer tous les principeux mouvements de l'histoire du cinéma allemand.",
    "postDate": "2022-12-15",
    "categories": [
      "montage",
      "cinéma"
    ],
    "content": "\nAujourd'hui, je fais quelque chose d'un peu différent... J'analyse et décortique le film Europa (1991) de Lars von Trier.\n\n<img src = \"blogs/europa/europa.webp\" alt=\"\">\n\n## Introduction\n\nTourné quelques mois suivant la chute du mur de Berlin mais se déroulant en Allemagne quelques mois suivant la fin de la deuxième guerre mondiale, Europa est un film post-moderne du réalisateur danois Lars von Trier. Bien qu’il s’agisse d’une coproduction Danemark-France-Allemagne-Suède, ce film peut être vu comme un pastiche de quasiment tous les grands mouvements de l’histoire du cinéma allemand : L’expressionnisme, le film noir, le mélodrame et le post-modernisme. Lars von Trier dit avoir été inspiré d’un livre pour enfants se déroulant dans un train pendant un rêve, mais dans le cas d’Europa, ce rêve est un rêve forcé par l’hypnose; un rêve sombre et brutal, qui nous est imposé par une voix inconnue. Sa trame narrative peut bien ressembler à celle d’un drame d’espionnage de la deuxième guerre mondiale comme ceux qui étaient produits par Hollywood dans les années 1940, mais sous la surface, c’est un réellement un film post-moderne comportant plusieurs niveaux de complexité. C’est un film d’architecte, un film où tout est réglé au quart de tour. \n\nCe que je tiens à soulever ici, ce sont les éléments qui font d’Europa non seulement un film post-moderne, mais également, bel et bien un film expressionniste pleinement assumé. Dans la première partie de ce texte, je me concentrerai sur les aspects expressionnistes et dans la deuxième sur les éléments post-modernes.\n\n\n## Europa, un film expressionniste\n\nLars von Trier utilise ici tous les éléments de l'esthétisme du cinéma expressionniste allemand pour ensuite se les réapproprier. Dès le début du film et son arrivée à Frankfurt, Leopold Kessler est plongé dans un univers d’ombres profondes et de lumières excessives, évoquant ce combat entre le bien et le mal qui perdure encore plusieurs mois après la fin de la guerre. Au cours des premières scènes du film, on le retrouve constamment entouré de clôtures et de barreaux, autant au sens propre que sous forme d’une imagerie métaphorique représentée par des carreaux de fenêtres, des toits d’usines et d’autres motifs quadrillés. C’est comme si, sans le savoir, il venait de pénétrer dans un pénitencier. Une fois le soleil levé, on lui interdit de regarder à l’extérieur pour ne pas réveiller les employés; ceci nous permet de demeurer dans ce monde de clair-obscur tout en contribuant à ce sentiment d’emprisonnement, d’absence de libre volonté. Dès le début, le destin Kafkaesque de Leopold est déjà fixé, il en est prisonnier et il ne pourra pas y échapper. Il est victime d’une chaîne d’événements déjà mis en place, ou plutôt, d’une chaîne d’événements qui lui sont expliqués, par le narrateur et les autres personnages, à son arrivée à Frankfurt. \n\n<img src = \"blogs/europa/cloture.webp\" alt=\"\">\n\nDurant l’une des scènes d’introduction, l’oncle de Leopold le met en garde : « Les citoyens allemands seront très gentils avec toi mais n'oublie pas que c'est par pur intérêt personnel. Tous les Allemands vont te détester, et d'après moi, à juste titre. » Il ne s’agit pas simplement d’un trait de personnalité antagoniste de l’oncle Kessler mais plutôt d’un important présage. Par la suite, Leo sera constamment manipulé d’une façon ou d’une autre par absolument tous ceux qu’il rencontre.\n\nTous ces personnages comportent une certaine dualité, ils ne sont que des simulacres qui projettent une image extérieure mais en cachent leur vraie identité : L'oncle de Leo est strict mais boit en cachette pendant son travail. Les deux enfants d’un « ami de la famille Hartmann » sont en réalité des assassins envoyés par les « Werewolfs ». Max Hartmann, patron de la Zentropa, est un ex sympathisant nazi. « Le juif », interprété par Lars von Trier, ment et protège Max Hartmann pour sauver sa propre peau... Et Katharina, la femme de Leopold, est et a toujours été un Werewolf.  \n\nCe qui nous amène à un autre élément typique du film expressionniste allemand : le jeu exagéré. Vers la fin du film, Katharina avoue finalement tout à Leo en un lent zoom se terminant en un plan très rapproché. Elle passe soudainement et brusquement de l’amour au reproche, tous deux joués de façon très exagérée, démontrant la psychose du personnage. C’est la castration métaphorique de Leo; il a soudainement tout perdu et il en vient finalement à la même réalisation que ce que son oncle lui avait dit au début : que tout le monde le manipule. Tous ces éléments, le jeu exagéré, le complexe de castration, les rappels, contribuent à l’inquiétante étrangeté de la scène. Et tout ceci n’est en effet que le début de la chute psychologique de Leo, une chute qui se terminera par la chute littérale du wagon dans la rivière et la mort de Leo. Une chute qui, elle aussi, avait déjà été présagée par la chute du train miniature s’effondrant après la scène d’amour de Leo et Katharina, symbole de leur relation désastreuse.\n\n\n## Europa, un film post-moderne\n\nTout au long du récit, nous sommes accompagnés par la voix hypnotisante de l’acteur suédois Max Von Sydow. Ce narrateur omniscient est toujours accompagné du rythme staccato d’instruments à cordes, simulacre du bruit répétitif d’un wagon de train sur un chemin de fer. Cette voix s’adressant simultanément à Leo et à nous à la deuxième personne, semble donc briser le quatrième mur. Elle vient nous chercher en tant que spectateurs, et nous invite à entrer dans l’histoire, à devenir Leopold Kessler, à « retourner » à Europa. Cependant, cet élément a également l’effet contraire, c'est-à-dire qu’il provoque une distanciation en nous rappelant que nous somme effectivement en train de visionner un film tout en soulevant de nombreuses questions en ce qui concerne l’origine temporelle de cette voix et la réalité même des événements. Comme le soulève Gabriel Giralt, l'expérience de Leo est-elle fictive, créée dans son imagination par suggestion hypnotique ou est-elle recréée alors qu'il se souvient d'expériences passées (Girald, 2001) ?\n\nDans le contexte de l’expressionnisme, cette narration contribue à ce que les allemands appellent « Unheimlich », l’inquiétante étrangeté. Comme le fait remarquer Aleks Wansbrough :\n\n    Un tel dispositif nous rappelle la narration peu fiable du Cabinet du Dr Caligari,\n    questionnant la nature de la perception et de la réalité ainsi que les dangers d'une\n    transe somnambulique, nous indiquant que ceux qui se présentent comme sains d'esprit\n    et rationnels cachent des pulsions sinistres. La narration (dans Europa) souligne la\n    possibilité que Kessler n'ait jamais eu le contrôle et donc, que, son destin ait\n    toujours été manipulé (Wansbrough, 2021).\n    \nEncore plus étrangement inquiétant : après la mort de Leopold, le narrateur continue à donner ses ordres. S’adresse-t-il à nous ? Au cadavre de Leo ? À une autre version de Leo qui n’a jamais réellement vécu ces événements ? Pendant qu’on cherche les réponses à ces questions et qu’on ose encore espérer une fin heureuse, le personnage principal, par la mort, semble finalement être libre. \n\nMais l’utilisation de cette narration n’est pas le seul élément qui fait d’Europa un film post-moderne. Tout au long du film, Lars von Trier utilise une quantité impressionnante de plans à projection arrière et à projection avant. Certains sont utilisés dans un contexte classique hollywoodien, servant à placer les acteurs dans des tournages polonais dans ce qui pourrait sembler être un souci économique. D’autres plans combinent des éléments dans un cadre pour un résultat artistique visant à faire avancer l’intrigue et à nous mettre dans la tête et l’émotion du personnage, comme l’avait fait F.W. Murnau dans Sunrise (1927).\n\n<img src = \"blogs/europa/retro.webp\" alt=\"\">\n\nCependant, une troisième catégorie ira jusqu’à combiner des éléments en couleur dans des scènes en noir et blanc à divers moments dans le film. Un exemple d’un tel cas a lieu durant la scène de la première rencontre entre Leopold et Katharina, l’idéologue et la femme fatale. À l’intérieur d’un même plan sans coupure, les deux futurs amants alternent leurs positions entre la couleur et le noir et blanc, ne partageant qu’un bref moment ensemble en couleur. Ici, Lars von Trier essaie de nous démontrer la difficulté du couple à trouver un terrain commun au début de leur relation; des différences qui les unissent autant qu’elles les séparent. Comme le souligne Gabriel Giralt, il s’agit aussi d’une métaphore de leur inhabilité à coexister ensemble au point de vue idéologique (Giralt, 2001). Ici, et tout au long du film, l’utilisation de la couleur est représentative de l’émotion intense, du point d’ancrage de la scène; de son centre dramatique. Une logique semblable a été reprise quelques années plus tard par Garry Ross pour son film Pleasantville (1998). Cependant, dans le cas de ce dernier, la séparation de la couleur et du noir et blanc fût effectuée avec l’aide de technologies numériques plutôt que par un procédé de projection arrière. Pour un film désirant représenter des personnages couleur dans un monde physiquement noir et blanc, le résultat était parfait. Cependant, dans le cas d'Europa, l’effet voulu était le contraire; l'artifice de la technique utilisée est plus important que l'effet lui-même. Lars von Trier cherchait l’énonciation créée par l’effet :\n\n    Nous avons beaucoup utilisé la rétroprojection, car j'adore la façon dont Hitchcock \n    l'a utilisée dans des films comme Vertigo. La rétroprojection crée un effet onirique \n    puisque c'est tellement irréel. Elle divise l'image en différentes couches, ce que \n    nous avons exagéré dans Europa en utilisant la couleur et le noir et blanc. \n    (Lars von Trier dans Lumholdt, 2003)\n    \n<img src = \"blogs/europa/couleur.webp\" alt=\"\">\n\nIl en va de même pour ce qui est de l’utilisation de la musique dans le film. Normalement, la musique et les effets sonores viennent dynamiser l’action; ils permettent de créer de l’identification et de la projection avec ce que vivent les personnages. Cependant, ici c’est le contraire. La trame musicale d’Europa, en grande partie, sert à accentuer les mouvements de caméra, à créer une réaction émotive à la présentation d’un trucage cinématographique, elle permet de pointer du doigt les techniques de production du film. C’est une forme d’énonciation subliminale qui a pour but d’attirer l’attention vers un second élément. Tous ensemble, la narration, la musique et les effets spéciaux rappellent constamment au spectateur qu’il est en train d’écouter un film, ce qui ajoute à l’ambiguïté et au sentiment de malaise créé par le film.\n\nUne scène marquante faisant utilisation de toutes ces techniques est la scène de l’assassinat du futur maire de Frankfurt à bord du train en route pour Cologne. Ici, en plus de la combinaison des images couleur et noir et blanc, on mélange les types de lentilles et les valeurs de plans pour augmenter le chaos et la tension dans la scène en déstabilisant davantage le spectateur. On y utilise également une autre forme d’énonciation narrative par le biais de l’augmentation exagérée des bruits ambiants du train, rendant le dialogue et les cris de la scène quasiment inaudibles, le tout résultant en un crescendo de tension. On coupe finalement à Leopold, sidéré et ce n’est qu’après avoir entendu des coups de mitraillette que toute l’ambiance sonore disparaît pour laisser place au retour du narrateur et de son thème musical. Ceux-ci nous transportent dans le temps via un autre exemple d’énonciation narratif; une coupure dans le temps qui remplace l’arrière-plan derrière Leo, nous transportant quelques jours plus tard. La transition s’avère si choquante par sa fluidité que Leo semble aussi surpris que nous par cette fracturation temporelle, comme s’il l’avait lui-même remarqué. De plus, lorsqu’on le félicite de sa réaction après l’assassinat, Leo affirme n’avoir rien fait, ce qui, du point de vue du spectateur est absolument vrai puisqu’il y a eu un saut dans le temps. \n\nOn pourrait même en déduire que le personnage de Leopold Kessler n’existe pas à l’extérieur des scènes du film. Au début du film, il est un tableau noir; tout le dialogue d’exposition vient de l’extérieur; soit du narrateur ou des autres personnages. Il ne connaît même pas son propre nom, c’est son oncle qui le lit dans son passeport avant de se présenter à lui comme étant son oncle. Lorsqu’il tente de lui parler de son père et de son voyage, l’oncle refuse catégoriquement d’entendre quoi que ce soit et on se demande même si Leopold aurait été en mesure de le faire. C’est un peu comme s’il était en train de jouer un jeu vidéo élaboré ou s’il était le seul spectateur d’une pièce de théâtre mis en scène spécifiquement pour lui. Tout ceci nous donne un résultat très onirique; un personnage vit sa vie sans connaître son passé et sans avoir aucun contrôle sur son propre destin.\n\n<img src = \"blogs/europa/ironie.webp\" alt=\"\">\n\nIl y a également une certaine ironie entourant toutes les actions posées par le personnage de Leopold Kessler. C’est un idéologue qui quitte l’Amérique pour venir rebâtir l’Allemagne mais qui finit par être la cause de la destruction du train et du pont sur lequel il se trouve, tuant un bon nombre de personnes. Même dès les premières scènes du film, il découvre que l’emploi de conducteur de train qu’il va avoir n’est ouvert qu’à ceux qui sont en mesure de défrayer les coûts reliés à l’uniforme. Comme le souligne Özlem Denli, ses intentions sont faussées dès le départ, puisqu'il semble occuper une position privilégiée dans un pays ravagé par la guerre et la misère (Denli, 2018). Il veut suivre la suggestion de Max Hartmann et toujours faire la bonne chose mais ses choix se retournent toujours contre lui.\n\n## Conclusion\n\nAprès une deuxième écoute, on réalise que cette narration nous invitant à « retourner » à Europa ne s’adresse réellement qu’à nous, le spectateur. Elle nous invite à nous replonger dans l’histoire une autre fois. Comme pour Leo, l’histoire est déjà décidée à l’avance et il n’y a rien qu’on puisse faire pour la changer. Leo est le spectateur et le spectateur est Leo.\n\nTout comme les personnages du film qui manipulent Leo, le réalisateur Lars von Trier manipule le spectateur du début à la fin. Ce film, étant souvent décris comme le film le plus accessible de toute sa cinématographie en est probablement aussi le plus complexe. Bien qu’à la surface, il ait l’apparence d’un simple film de guerre ou d’espionnage, il est en réalité une expérience méta-psychique un hommage au cinéma allemand, à ses thèmes et ses techniques cinématographiques. C’est un film post-moderne faisant hommage au mouvement du cinéma expressionniste allemand. « C'est une célébration du médium filmique en tant que tel ainsi que de son pouvoir hypnotique (Langkjær, 2021). » \n\nC’est un film qui a pour but de manipuler, d’aller chercher le spectateur et de demeurer dans son subconscient longtemps après la fin de la projection.  Comme le dit le narrateur lors de la dernière scène du film : « Vous voulez vous réveiller, vous libérer de l’image d’Europa, mais ce n’est pas possible. » \n\n<br />\n<br />\n \n## Bibliographie\n\nvon Trier, Lars, réalisateur, Europa, Danemark, Nordisk Film, 1991, 147 min.\n\nThe making of Europa, France, Same Films, 1991, 39 min.\n\nDenli, Özlem, « Political Claustrophobia in Lars von Trier’s Europa and America Trilogies », CINEJ Cinema Journal, vol 7.1, 2018, p. 229-230\n\nGiralt, Gabriel, « The Existential Framework of Zentropa’s Narrative », Kinema, printemps 2001, 14 f.\n\nKoutsourakis, Angelos, « ‘You Want to Wake up to Free Yourself of the Image of Europa. But It Is Not Possible’: Lars von Trier's Critique of the European Narrative of Progress in His Europa Trilogy », Journal of Contemporary European Studies, vol 20, no 4, décembre 2012, p. 517-535\n\nLangkjær, Birger, « Musical marionettes: sound and music in Lars von Trier’s Europe trilogy », Studies in European Cinema, 24 septembre 2021, 14 f.\n\nLumholdt, Jan, Lars von Trier: Interviews, University Press of Mississippi, 2003, 270 p.\n\nWansbrough, Aleks « Lars von Trier and German Expressionism: Understanding von Trier’s Transnational Appeal » dans Herrschner, I., Stevens, K., Nickl, B. (eds) Transnational German Cinema. Global Germany in Transnational Dialogues. Suisse, Springer Nature, 2021, p. 167-178\n"
  }
]