[
  {
    "id": "bienvenue-sur-mon-nouveau-site-web-!",
    "title": "Bienvenue sur mon nouveau site web !",
    "author": "Mathieu Lalonde",
    "photo": "selfie_lg.webp",
    "abstract": "C'est aujourd'hui le grand jour; la nouvelle mouture de mathieulalonde.com est enfin là.",
    "postDate": "2024-05-15",
    "categories": [
      "general",
      "web",
      "tech"
    ],
    "content": "\n*3... 2... 1... c'est parti !!*\n\nC'est aujourd'hui le grand jour; la nouvelle mouture de *mathieulalonde.com* est enfin là.\n\nLes blogs précédents y on parfois fait allusion mais on voit enfin où tout s'en allait.\n\nCe nouveau site m'a effectivement permit de découvrir de nouvelles technologies, de me rafraîchir la mémoire sur d'autres et d'approfondir mes connaissances sur celles qui m'étaient déjà familières.\n\n\n## Une évolution progressive\n\n\n<!--<img src = \"/blogs/sites_web/site_mjl.webp\" alt=\"Mon premier site web\" class=\"blogphoto\">-->\n<img src = \"/blogs/sites_web/site_impact.webp\" alt=\"Le site web d'Impact Video, circa 1998\" class=\"blogphoto\">\n<figcaption>Le site web d'Impact Video, circa 1998. Impact Vidéo (anciennement ECC Vidéo) était une compagnie fondée par Mathieu Lalonde et Christian Coulombe, se spécialisant dans les tournages vidéo multi-caméra et la construction de sites web.</figcaption>\n\n\nCe fut un long parcours depuis mon premier site construit dans *Corel Web.Designer* (la version démo où on n'avait qu'à effacer une clé dans *RegEdit* pour remettre son compteur à zéro), puis les *DreamWeaver* et *HomeSite*, les *Joomla* et les *Flask (Python)* dans *VS Code*... Mais on y est enfin arrivé.\n\n\nConçu dans *React* (*Typescript*) avec *Vite*, un blog *Markdown*, *Sass-y CSS*, *PostCSS*, *SVG*, *Git* et un tas d'autres acronymes difficiles à prononcer... mathieulalonde.com entre dans l'ère moderne !\n\n## Pour la suite\n\nJ'ai encore plein d'idées de trucs à ajouter au site alors c'est pas fini. Et y'a pas seulement que le site, non plus! Pour continuer d'aller de l'avant, ce blogue me permettra de continuer d'explorer mes projets intérêts et de vous partager mes découvertes. \n\nRevenez me voir de temps en temps; j'suis pas sorteux!"
  },
  {
    "id": "recreer-un-effet-vhs-en-css-et-svg.",
    "title": "Recréer un effet VHS en CSS et SVG.",
    "author": "Mathieu Lalonde",
    "photo": "blogs/vhs_play/vhs_cu.webp",
    "abstract": "Comment recréer un effet de chargement de cassette VHS, style 1991.",
    "postDate": "2024-04-05",
    "categories": [
      "css",
      "svg"
    ],
    "content": "\n<img src = \"/blogs/vhs_play/vhs_ws.webp\" alt=\"Mon CV sous forme de livret\" class=\"blogphoto\">\n\nVoici un effet intéressant que j'ai créé en travaillant sur la nouvelle version de mon site web (et son incorporation de fichiers vidéos). Il m'est donc passé par la tête de recréer pour le web, un effet de chargement de cassette VHS, circa 1991.\n\nLe processus qui suit est tout de même plutôt simple mais c'est la concaténation de plusieurs petits détails qui aident à vraiment donner de la crédibilité à l'effet.\n\n<!--(Pour ceux qui sont trop jeunes pour l'avoir connu (ou trop vieux pour s'en souvenir), voici un exemple retrouvé sur YouTube qui illustre assez bien ce que j'avais en tête : )-->\n\n<!--<VideoPlayer src=\"https://www.youtube-nocookie.com/embed/_c2V75k-ilQ?si=llNZsuKC7V7sK7ld\" />-->\n\n## L'arrière plan\n\nDans un fichier CSS, j'ai tout d'abord commencé avec un fond bleu, plein écran. Pour ajouter un peu de profondeur, j'ai ajouté un gradient radial, question de simuler un tube à rayons cathodique bombé (et un peu mal calibré) :\n\n```CSS\nhtml,\nbody {\n  background: radial-gradient(circle, #0000ff 0%, #2119c4 60%, #280970 100%)\n}\n```\n\n\n## Créer le texte\n\nPour le texte &laquo; PLAY &raquo; lui même, j'ai choisi la typo \n[VCR OSD Neue](https://www.dafont.com/vcrosdneue.font) mais vraiment n'importe quel typo du genre aurait pu faire l'affaire.\n\nÀ ce point-ci, j'avais un choix à faire : convertir le texte en un élément graphique ou non. En version texte, il serrait facilement remplaçable et modifiable mais j'aurais tout d'abord à convertir la typo **TrueType** en **.woff** et la publier sur le serveur pour, en bout de ligne, n'afficher que quatre lettres. J'ai donc opté pour convertir le texte en **SVG** à la place.\n\nDans *Photoshop*, tout d'abords créé une page vide et tapé le texte voulu puis. \n\nAttention : ici, l'option `Copy SVG` nous exportera un fichier SVG qui fait essentiellement la même chose que d'écrire le texte dans un document HTML. À l'autre extrême, si on utilise `Rasterise Type` avant de copier le texte, on obtiendra une image PNG complète encodé en base 64 à même le fichier SVG.\n\nIl faut donc utiliser l'option `Convert to Shape` qui, avant de copier vers SVG, convertira le texte en image vectorielle.\n\n<img src = \"blogs/vhs_play/vhs_play-plain.svg\" alt=\"\">\n\n### Note:\nAu lieu d'utiliser Photoshop, il est possible d'effectuer les mêmes démarches avec le logiciel gratuit [Inkskape](https://inkscape.org/). Le résultat contiendra cependant plusieurs lignes de métadonnées supplémentaires. Un point positif, c'est que chaque lettre sera isolée dans son propre `path`, permettant éventuellement des manipulations plus granulaires.\n\n\n\n## Incorporer et animer le texte\n\nPour toujours garder la taille du texte relativement la même à l'écran, peu importe l'orientation, j'utilise un `width: max(10vw, 20vh)`.\n\nJe crée également une petite animation pour simuler rapidement un peu d'interférence. \n\nPuisqu'un signal vidéo analogique NTSC est composé de 486 lignes de résolution verticales et une résolution horizontale qui varie selon la qualité du signal, cette distorsion n'a uniquement lieu qu'en termes de déplacements horizontaux aléatoires. Mais, en bout de ligne, ce n'est que l'impression générale qui compte ici.\n\n```CSS\n\n@keyframes glitch {\n  10% {\n    transform: translate(-0.5px, 0) skew(0deg);\n  }\n  27% {\n    transform: translate(1px, 0) skew(1deg);\n  }\n  30% {\n    transform: translate(-1px, 0) skew(1deg);\n  }\n  47% {\n    transform: translate(0.5px, 0) skew(0.5deg);\n  }\n  50% {\n    transform: translate(-0.5px, 0) skew(0.5deg);\n  }\n  67% {\n    transform: translate(0px, 0) skew(0deg);\n  }\n  70% {\n    transform: translate(-0.5px, 0) skew(0.5deg);\n  }\n  87% {\n    transform: translate(1px, 0) skew(1deg);\n  }\n  90% {\n    transform: translate(-2px, 0) skew(2deg);\n  }\n  100% {\n    transform: translate(1px, 0) skew(1deg);\n  }\n}\n\n.vhs_play {\n  width: max(10vw, 20vh);\n  padding: 6%;\n  opacity: 90%;\n  \n  animation: glitch 1s linear infinite alternate;\n}\n```\n\n## Flouter le texte\n\nÀ ce point-ci, tout a l'air trop propre. J'ai donc ajouté un flou horizontal pour simuler une perte de résolution. Il s'agit d'un effet plus simple à recréer en directement en SVG qu'en CSS alors je l'ai appliqué à même le fichier SVG.\n\nEn même temps, j'ai ajouté une ombre magenta pour dégrader l'image davantage.\n\n```XML\n   <defs>\n      <filter id=\"blur\">\n         <feGaussianBlur in=\"SourceGraphic\" stdDeviation=\"20, 0\" />\n      </filter>\n\n      <filter id='shadow' color-interpolation-filters=\"sRGB\">\n         <feDropShadow dx=\"-15\" dy=\"0\" stdDeviation=\"3\" flood-opacity=\"1\" flood-color=\"red\"/>\n      </filter>\n      \n   </defs>\n```\n\net `style=\"filter: url(#blur) url(#shadow)\"` à l'élément `path` du même SVG. Ça donne ceci :\n\n<img src = \"blogs/vhs_play/vhs_play.svg\" alt=\"\">\n\n## Les petits détails\n\nJ'aurais pu arrêter ici mais j'ai décidé d'ajouter quelques petits détails pour bien vendre le look:\n\n### La demi-ligne\n\nLe premier est quasiment subliminal; il s'agit de la demi-ligne noire au bas droit de l'écran. Dans un signal analogique, la dernière ligne au bas de l'écran n'est qu'une demie ligne. Ceci est parfois visible lorsqu'on visionne une vielle vidéo sur un écran d'ordinateur -- cette partie de l'image aurait normalement été cachée par les rebords du téléviseur.\n\nEt bien sûr, cette ligne a sa propre animation bien à elle. \n\n### Les lignes de balayage\n \nJ'ai aussi adapté un *look* lignes de résolution à partir de celui de [@meduzen](https://codepen.io/meduzen/pen/zxbwRV) en ne conservant que l'essentiel.\n \n\n## Une dernière chose\n\nFinalement, j'ai créé une deuxième animation pour ajouter un délais d'une demi-seconde avant l'apparition du &laquo; play &raquo; à l'écran :\n\n```CSS\n@keyframes wait_start {\n  0% {\n    opacity: 0%;\n  }\n  90% {\n    opacity: 0%;\n  }\n  100% {\n    opacity: 90%;\n  }\n}\n```\n\n<div className=\"videocontainer\"><iframe className=\"videoplayer\" src=\"/blogs/vhs_play/index.html\"} /></div>\n\n\n<a href=\"/blogs/vhs_play/index.html\" target=\"_blank\">Cliquez ici pour le voir plein écran.</a>"
  },
  {
    "id": "quelques-facons-alternatives-de-presenter-son-cv.",
    "title": "Quelques façons alternatives de présenter son CV.",
    "author": "Mathieu Lalonde",
    "photo": "blogs/cv_booklet/Outside_Mockup.webp",
    "abstract": "Dans le cadre d'une offre d'emploi récemment publiée sur LinkedIn, unemployeur demandait à ses candidats de fournir deux choses qui sortent légèrement de l'ordinaire.",
    "postDate": "2024-03-05",
    "categories": [
      "general",
      "montage",
      "photoshop"
    ],
    "content": "\nDans le cadre d'une offre d'emploi récemment publiée sur LinkedIn, l'employeur (une grande agence publicitaire), demandait à ses candidats de fournir deux choses qui sortent légèrement de l'ordinaire.\n\nLa première était de répondre à la question : &laquo; Qu'est-ce qui me passionne ? &raquo;, et la deuxième était de fournir un CV &laquo; atypique &raquo;. Ces deux items pouvaient être fournis sous une multitudes de formats différents, des plus ordinaires aux plus farfelus. Et puisque l'un d'entre eux était de soumettre une vidéo... je me suis senti obligé de le faire, bien sûr !\n\n## Une vidéo\n\nJ'ai tout d'abord songé à présenter mon CV sous forme de vidéo mais la limite de temps stipulée d'une minute me semblait un peu trop contraignante. J'ai donc opté pour parler de ma passion pour l'informatique en utilisant ce médium.\n\n<VideoPlayer src=\"https://www.youtube-nocookie.com/embed/DXUfddvlo8Q?si=0W6tFwgVAGDSc1o7\" />\n\nLe montage est fortement inspiré de ma dernière démo de monteur et récupère une partie de ce tournage pour en faire quelque chose complètement différent qui me présente sous toutes mes facettes.\n\n## Un livret\n\nPour le CV lui-même, j'ai pensé le créer sous la forme d'un livret livret carré, un peu comme ceux que l'on retrouverait dans le boîtier d'un disque compact.\n\n<img src = \"/blogs/cv_booklet/Cover_Mockup.webp\" alt=\"Mon CV sous forme de livret\" class=\"blogphoto\">\n<img src = \"/blogs/cv_booklet/Outside_Mockup.webp\" alt=\"Mon CV sous forme de livret - ouvert\"     class=\"blogphoto\">\n<img src = \"/blogs/cv_booklet/Inside_Mockup_6-7.webp\" alt=\"L'intérieur du livret\" class=\"blogphoto\">\n<img src = \"/blogs/cv_booklet/Inside_Mockup_10-11.webp\" alt=\"L'intérieur du livret\" class=\"blogphoto\">\n\nNon, je ne suis pas sur le point de lancer un album ... mais voici à quoi mon CV ressemblerait dans un boîtier à CD :\n\n<img src = \"/blogs/cv_booklet/Box_Mockup.webp\" alt=\"Le livret à l'intérieur d'un boiter à CD\" class=\"blogphoto\">\n\n## Téléchargement\n\nVoici le <a href=\"/blogs/cv_booklet/CV_Mathieu_Lalonde(livret).pdf\" target=\"_blank\"> PDF du CV complet</a> à télécharger. Notez-bien que, contrairement à mon résumé standard, celui-ci ne sera pas continuellement mis à jour...\n\nAlors, qu'en pensez-vous ? C'est une bonne idée ?\n\nPersonnellement, je trouve ça un peu dommage que les copies de CV physiques soient chose du passé. Mais pas trop."
  }
]